{
  "textsLanguages": [
    {
      "id": "fr",
      "play": "Jouer",
      "achievement": "Succes",
      "options": "Options",
      "quit": "Quitter",
      "back": "Retour",
      "display": "Affichage",
      "fullscreen": "Plein ecran",
      "windowed": "Fenetre",
      "windowedFullscreen": "Plein ecran fenetre",
      "music": "Volume de la musique",
      "sound": "Volume des effets sonores",
      "language": "Langue",
      "previous": "Precedent",
      "next": "Suivant",
      "skip": "Passer",
      "tutoP1Main": "But du jeu",
      "tutoP1Text": "Tu incarnes une vampire dans la derniere ligne droite d'un rituel puissant. L'objectif est de survivre jusqu'a minuit et d'invoquer un demon. Mais attention, le village voisin envoie ses troupes pour t'arreter ! A minuit, le roi arrive pour te combattre. Si tu le bats, tu termines le jeu. Si ton rituel est detruit ou si tu perds tout ton sang, c'est la fin !",
      "tutoP2Main": "Le Rituel",
      "tutoP2Text": "Le rituel est l'element central de ta defense. Il se trouve au coeur du chateau, et tu dois le proteger a tout prix. Il partage tes points de vie, que tu dois surveiller de pres, car si les ennemis le detruisent, tu perds la partie.",
      "tutoP3Main": "Les Unites",
      "tutoP3Text": "Les unites sont tes alliees. Elles te defendent contre les envahisseurs du village. Chaque unite a un cout (en sang) et un role particulier dans ta strategie.",
      "tutoP4Main": "Le Sang",
      "tutoP4Text": "Ton sang est la ressource la plus precieuse du jeu. Il est a la fois tes points de vie, ta monnaie pour invoquer des unites, et la vie du rituel. Gere-le avec soin, car chaque action te coute du sang.",
      "tutoP5Main": "Le Roi",
      "tutoP5Text": "A minuit, le roi arrive ! C'est ton dernier et plus redoutable adversaire. Il est puissant et possede beaucoup de points de vie. Pour gagner la partie, tu dois le vaincre avant qu'il ne detruise ton rituel.",
      "tutoP6Main": "Les Cercueils",
      "tutoP6Text": "Dans le chateau, tu trouveras quatre cercueils dissemines a differents endroits. Ces cercueils te permettent de te teleporter d'un endroit a un autre pour te deplacer rapidement et repondre aux attaques.",
      "pause": "Pause",
      "resume": "Retour au Jeu",
      "menu": "Menu Principal",
      "blood": "Sang",
      "wave": "Vague",
      "cost": "Cout",
      "ritualDamage": "L'ennemi attaque le rituel !",
      "gameOver": "Game Over",
      "victory": "Victoire",
      "portalOpen": "Le portail est ouvert !",
      "waveDisplay": "Vous avez atteint la Xeme vague !",
      "score": "Score",
      "replay": "Rejouer"
    },
    {
      "id": "en",
      "play": "Play",
      "achievement": "Achievements",
      "options": "Options",
      "quit": "Quit",
      "back": "Back",
      "display": "Display",
      "fullscreen": "Fullscreen",
      "windowed": "Windowed",
      "windowedFullscreen": "Windowed Fullscreen",
      "music": "Music Volume",
      "sound": "Sound Volume",
      "language": "Language",
      "previous": "Previous",
      "next": "Next",
      "skip": "Skip",
      "tutoP1Main": "Goal of the game",
      "tutoP1Text": "You play as a vampire in the final stage of a powerful ritual. The goal is to survive until midnight and summon a demon. But beware, the neighboring village sends its troops to stop you! At midnight, the king arrives to fight you. If you defeat him, you win the game. If your ritual is destroyed or if you lose all your blood, it's game over!",
      "tutoP2Main": "The Ritual",
      "tutoP2Text": "The ritual is the central element of your defense. It is located at the heart of the castle, and you must protect it at all costs. It shares your life points, which you must keep a close eye on, because if the enemies destroy it, you lose the game.",
      "tutoP3Main": "The Units",
      "tutoP3Text": "The units are your allies. They defend you against the invaders from the village. Each unit has a cost (in blood) and a specific role in your strategy.",
      "tutoP4Main": "The Blood",
      "tutoP4Text": "Your blood is the most precious resource in the game. It is both your life points, your currency to summon units, and the life of the ritual. Manage it carefully, because each action costs you blood.",
      "tutoP5Main": "The King",
      "tutoP5Text": "At midnight, the king arrives! He is your last and most formidable opponent. He is powerful and has a lot of life points. To win the game, you must defeat him before he destroys your ritual.",
      "tutoP6Main": "The Coffins",
      "tutoP6Text": "In the castle, you will find four coffins scattered in different places. These coffins allow you to teleport from one place to another to move quickly and respond to attacks.",
      "pause": "Pause",
      "resume": "Resume",
      "menu": "Main Menu",
      "blood": "Blood",
      "wave": "Wave",
      "cost": "Cost",
      "ritualDamage": "The enemy is attacking the ritual!",
      "gameOver": "Game Over",
      "victory": "Victory",
      "portalOpen": "The portal is open!",
      "waveDisplay": "You have reached the Xth wave!",
      "score": "Score",
      "replay": "Replay"
    }
  ]
}